'skip scanner'

// 时，分，秒格式转换
export const countDownText = {
  zh_cn: ['天', '时', '分', '秒', '已结束', '活动已结束'],
  zh_tw: ['天', '時', '分', '秒', '已結束', '活動已結束'],
  en: ['D', 'H', 'M', 'S', 'Ended', 'The event is over'],
  ar: ['يوم', 'ساعة', 'دقيقة', 'ثانية', 'انتهى', 'انتهى الحدث'],
  th: [
    'วัน',
    'ชั่วโมง',
    'นาที',
    'วินาที',
    'สิ้นสุดลงแล้ว',
    'กิจกรรมสิ้นสุดแล้ว'
  ],
  id: [
    'hari',
    'jam',
    'menit',
    'detik',
    'Sudah selesai',
    'Event telah berakhir'
  ],
  vi: ['Ngày', 'Giờ', 'Phút', 'Giây', 'Đã kết thúc', 'Sự kiện đã kết thúc'],
  ko: ['일', '시', '분', '초', '종료되었습니다 ', '이벤트가 이미 종료됩습니다'],
  ja: ['日', '時', '分', '秒', '終了しました', 'イベントが終了しました']
}

// 时，分，秒格式转换
export const CidInfoText = {
  zh_cn: ['**天', '**小时', '**钻'],
  zh_tw: ['**天', '**小時', '**鉆'],
  en: ['**Day', '**Hour', '**💎'],
  ar: ['** يوم', '**ساعة', '**ماسة'],
  th: ['**วัน', '**ชั่วโมง', '**เพชร'],
  id: ['** hari', '** jam', '**💎'],
  vi: ['** Ngày', '** Giờ', '** KC'],
  ko: ['**일', '**시간', '**💎'],
  ja: ['**日', '**時間', '**💎']
}

// 通用text
export const CommonText = {
  zh_cn: ['暂无数据', '规则'],
  zh_tw: ['暫無數據', '規則'],
  en: ['No Data', 'Rules'],
  ar: ['لا توجد بيانات حاليا', 'قواعد'],
  th: ['ไม่มีข้อมูล', 'กติกา'],
  id: ['Belum ada data', 'Aturan'],
  vi: ['Tạm không có dữ liệu', 'Thể lệ'],
  ko: ['아직 데이터가 없습니다.', '규칙'],
  ja: ['データがありません', 'ルール']
}
